### Module: etl_lambda
#### Terraform Format and Style 🖌`success`
#### Terraform Plan 📖`success`

<details>
  <summary>Show Plan</summary>

  ```terraform
  aws_cloudwatch_event_rule.twice-a-day: Refreshing state... [id=twice-a-day]
module.unmasked_metrics.aws_cloudwatch_log_group.metric_log: Refreshing state... [id=/aws/lambda/unmasked_metrics]
module.masked_metrics.aws_cloudwatch_log_group.metric_log: Refreshing state... [id=/aws/lambda/masked_metrics]
aws_iam_role.metrics_csv: Refreshing state... [id=metrics_csv_lambda_role]

An execution plan has been generated and is shown below.
Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # aws_cloudwatch_event_target.tigger-masked_metrics will be created
  + resource "aws_cloudwatch_event_target" "tigger-masked_metrics" {
      + arn            = (known after apply)
      + event_bus_name = "default"
      + id             = (known after apply)
      + rule           = "twice-a-day"
      + target_id      = "masked_metrics"
    }

  # aws_cloudwatch_event_target.tigger-unmasked_metrics will be created
  + resource "aws_cloudwatch_event_target" "tigger-unmasked_metrics" {
      + arn            = (known after apply)
      + event_bus_name = "default"
      + id             = (known after apply)
      + rule           = "twice-a-day"
      + target_id      = "unmasked_metrics"
    }

  # aws_iam_role_policy_attachment.etl_policies will be created
  + resource "aws_iam_role_policy_attachment" "etl_policies" {
      + id         = (known after apply)
      + policy_arn = jsonencode(
            {
              + Statement = [
                  + {
                      + Action   = [
                          + "dynamodb:Scan",
                          + "dynamodb:Query",
                          + "dynamodb:GetItem",
                          + "dynamodb:ConditionCheckItem",
                          + "dynamodb:BatchGetItem",
                        ]
                      + Effect   = "Allow"
                      + Resource = "arn:aws:dynamodb:ca-central-1:005133826942:table/aggregate_metrics"
                      + Sid      = ""
                    },
                  + {
                      + Action   = [
                          + "ecr:GetDownloadUrlForlayer",
                          + "ecr:BatchGetImage",
                        ]
                      + Effect   = "Allow"
                      + Resource = "arn:aws:ecr:ca-central-1:005133826942:repository/covid-server/metrics-server"
                      + Sid      = ""
                    },
                  + {
                      + Action   = [
                          + "logs:PutLogEvents",
                          + "logs:CreateLogStream",
                        ]
                      + Effect   = "Allow"
                      + Resource = [
                          + "arn:aws:logs:ca-central-1:005133826942:log-group:/aws/lambda/unmasked_metrics",
                          + "arn:aws:logs:ca-central-1:005133826942:log-group:/aws/lambda/masked_metrics",
                        ]
                      + Sid      = ""
                    },
                  + {
                      + Action   = [
                          + "ec2:DescribeNetworkInterfaces",
                          + "ec2:DeleteNetworkInterface",
                          + "ec2:CreateNetworkInterface",
                        ]
                      + Effect   = "Allow"
                      + Resource = "*"
                      + Sid      = ""
                    },
                  + {
                      + Action   = [
                          + "s3:PutObjectAcl",
                          + "s3:PutObject",
                        ]
                      + Effect   = "Allow"
                      + Resource = [
                          + "arn:aws:s3:::unmasked-metrics-snfsv-staging",
                          + "arn:aws:s3:::masked-metrics-snfsv-staging",
                        ]
                      + Sid      = ""
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + role       = "metrics_csv_lambda_role"
    }

  # aws_lambda_permission.allow-cloudwatch-to-call-masked_metrics will be created
  + resource "aws_lambda_permission" "allow-cloudwatch-to-call-masked_metrics" {
      + action        = "lambda:InvokeFunction"
      + function_name = "masked_metrics"
      + id            = (known after apply)
      + principal     = "events.amazonaws.com"
      + source_arn    = "arn:aws:events:ca-central-1:005133826942:rule/twice-a-day"
      + statement_id  = "AllowExecutionFromCloudWatch"
    }

  # aws_lambda_permission.allow-cloudwatch-to-call-unmasked_metrics will be created
  + resource "aws_lambda_permission" "allow-cloudwatch-to-call-unmasked_metrics" {
      + action        = "lambda:InvokeFunction"
      + function_name = "unmasked_metrics"
      + id            = (known after apply)
      + principal     = "events.amazonaws.com"
      + source_arn    = "arn:aws:events:ca-central-1:005133826942:rule/twice-a-day"
      + statement_id  = "AllowExecutionFromCloudWatch"
    }

  # module.masked_metrics.aws_lambda_function.lambda will be created
  + resource "aws_lambda_function" "lambda" {
      + arn                            = (known after apply)
      + function_name                  = "masked_metrics"
      + id                             = (known after apply)
      + image_uri                      = "005133826942.dkr.ecr.ca-central-1.amazonaws.com/covid-server/metrics-server:latest"
      + invoke_arn                     = (known after apply)
      + last_modified                  = (known after apply)
      + memory_size                    = 128
      + package_type                   = "Image"
      + publish                        = false
      + qualified_arn                  = (known after apply)
      + reserved_concurrent_executions = -1
      + role                           = "arn:aws:iam::005133826942:role/metrics_csv_lambda_role"
      + signing_job_arn                = (known after apply)
      + signing_profile_version_arn    = (known after apply)
      + source_code_hash               = (known after apply)
      + source_code_size               = (known after apply)
      + tags_all                       = (known after apply)
      + timeout                        = 900
      + version                        = (known after apply)

      + environment {
          + variables = {
              + "BUCKET_NAME" = "masked-metrics-snfsv-staging"
              + "MASK_DATA"   = "true"
            }
        }

      + tracing_config {
          + mode = (known after apply)
        }

      + vpc_config {
          + security_group_ids = [
              + "sg-090d16d17a0b6c2b1",
            ]
          + subnet_ids         = [
              + "subnet-07f256fc1e9b65732",
            ]
          + vpc_id             = (known after apply)
        }
    }

  # module.unmasked_metrics.aws_lambda_function.lambda will be created
  + resource "aws_lambda_function" "lambda" {
      + arn                            = (known after apply)
      + function_name                  = "unmasked_metrics"
      + id                             = (known after apply)
      + image_uri                      = "005133826942.dkr.ecr.ca-central-1.amazonaws.com/covid-server/metrics-server:latest"
      + invoke_arn                     = (known after apply)
      + last_modified                  = (known after apply)
      + memory_size                    = 128
      + package_type                   = "Image"
      + publish                        = false
      + qualified_arn                  = (known after apply)
      + reserved_concurrent_executions = -1
      + role                           = "arn:aws:iam::005133826942:role/metrics_csv_lambda_role"
      + signing_job_arn                = (known after apply)
      + signing_profile_version_arn    = (known after apply)
      + source_code_hash               = (known after apply)
      + source_code_size               = (known after apply)
      + tags_all                       = (known after apply)
      + timeout                        = 900
      + version                        = (known after apply)

      + environment {
          + variables = {
              + "BUCKET_NAME" = "unmasked-metrics-snfsv-staging"
              + "MASK_DATA"   = "false"
            }
        }

      + tracing_config {
          + mode = (known after apply)
        }

      + vpc_config {
          + security_group_ids = [
              + "sg-090d16d17a0b6c2b1",
            ]
          + subnet_ids         = [
              + "subnet-07f256fc1e9b65732",
            ]
          + vpc_id             = (known after apply)
        }
    }

Plan: 7 to add, 0 to change, 0 to destroy.

------------------------------------------------------------------------

Note: You didn't specify an "-out" parameter to save this plan, so Terraform
can't guarantee that exactly these actions will be performed if
"terraform apply" is subsequently run.
  ```
</details>